-- Категории
INSERT INTO categories (id, name, is_active, parent_id) VALUES
                                                            ('11111111-1111-1111-1111-111111111111', 'Электроника', true, NULL),
                                                            ('22222222-2222-2222-2222-222222222222', 'Смартфоны', true, '11111111-1111-1111-1111-111111111111');

-- Товары
INSERT INTO products (id, name, price, sku, stock, category_id) VALUES
                                                                    ('33333333-3333-3333-3333-333333333333', 'iPhone 15', 999.99, 'IPHONE15', 50, '22222222-2222-2222-2222-222222222222'),
                                                                    ('44444444-4444-4444-4444-444444444444', 'Galaxy S23', 899.99, 'SAMSUNG-S23', 30, '22222222-2222-2222-2222-222222222222');

-- Изображения
INSERT INTO product_images (id, url, is_main, product_id) VALUES
                                                              ('55555555-5555-5555-5555-555555555555', 'https://example.com/iphone.jpg', true, '33333333-3333-3333-3333-333333333333'),
                                                              ('66666666-6666-6666-6666-666666666666', 'https://example.com/galaxy.jpg', true, '44444444-4444-4444-4444-444444444444');